; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob82) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate5)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate3)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 distributor2)
	(clear pallet10)
	(at pallet11 depot0)
	(clear crate1)
	(at pallet12 depot2)
	(clear pallet12)
	(at pallet13 depot0)
	(clear crate4)
	(at pallet14 depot1)
	(clear crate0)
	(at truck0 depot1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at crate0 depot1)
	(on crate0 pallet14)
	(at crate1 depot0)
	(on crate1 pallet11)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 distributor2)
	(on crate3 crate2)
	(at crate4 depot0)
	(on crate4 pallet13)
	(at crate5 depot2)
	(on crate5 pallet2)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 crate3)
		(on crate2 pallet3)
		(on crate3 pallet4)
		(on crate4 pallet10)
		(on crate5 pallet0)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 6
2. (lift hoist1 crate0 pallet14 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet14)
   added: (lifting hoist1 crate0) (clear pallet14)
   goals met: 0 of 6
3. (load hoist1 crate0 truck0 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 0 of 6
4. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 0 of 6
5. (unload hoist8 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist8)
   added: (lifting hoist8 crate0)
   goals met: 0 of 6
6. (lift hoist6 crate1 pallet11 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist6) (on crate1 pallet11)
   added: (lifting hoist6 crate1) (clear pallet11)
   goals met: 0 of 6
7. (load hoist6 crate1 truck1 depot0)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck1) (available hoist6)
   goals met: 0 of 6
8. (lift hoist6 crate4 pallet13 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist6) (on crate4 pallet13)
   added: (lifting hoist6 crate4) (clear pallet13)
   goals met: 0 of 6
9. (load hoist6 crate4 truck1 depot0)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck1) (available hoist6)
   goals met: 0 of 6
10. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 0 of 6
11. (unload hoist7 crate1 truck1 distributor2)
   deleted: (in crate1 truck1) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 0 of 6
12. (lift hoist2 crate5 pallet2 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet2)
   added: (lifting hoist2 crate5) (clear pallet2)
   goals met: 0 of 6
13. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 0 of 6
14. (load hoist2 crate5 truck0 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 0 of 6
15. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 0 of 6
16. (unload hoist6 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 0 of 6
17. (drop hoist6 crate5 pallet0 depot0)
   deleted: (lifting hoist6 crate5) (clear pallet0)
   added: (available hoist6) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 1 of 6
18. (lift hoist5 crate3 crate2 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 crate2)
   added: (lifting hoist5 crate3) (clear crate2)
   goals met: 1 of 6
19. (load hoist8 crate0 truck1 distributor2)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck1) (available hoist8)
   goals met: 1 of 6
20. (drop hoist5 crate3 pallet8 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet8)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet8)
   goals met: 1 of 6
21. (unload hoist8 crate0 truck1 distributor2)
   deleted: (in crate0 truck1) (available hoist8)
   added: (lifting hoist8 crate0)
   goals met: 1 of 6
22. (drop hoist8 crate0 crate2 distributor2)
   deleted: (lifting hoist8 crate0) (clear crate2)
   added: (available hoist8) (at crate0 distributor2) (clear crate0) (on crate0 crate2)
   goals met: 2 of 6
23. (unload hoist8 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist8)
   added: (lifting hoist8 crate4)
   goals met: 2 of 6
24. (drop hoist8 crate4 pallet10 distributor2)
   deleted: (lifting hoist8 crate4) (clear pallet10)
   added: (available hoist8) (at crate4 distributor2) (clear crate4) (on crate4 pallet10)
   goals met: 3 of 6
25. (lift hoist8 crate3 pallet8 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist8) (on crate3 pallet8)
   added: (lifting hoist8 crate3) (clear pallet8)
   goals met: 3 of 6
26. (load hoist8 crate3 truck1 distributor2)
   deleted: (lifting hoist8 crate3)
   added: (in crate3 truck1) (available hoist8)
   goals met: 3 of 6
27. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 3 of 6
28. (unload hoist9 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 3 of 6
29. (drop hoist9 crate3 pallet4 distributor1)
   deleted: (lifting hoist9 crate3) (clear pallet4)
   added: (available hoist9) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 4 of 6
30. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 4 of 6
31. (load hoist7 crate1 truck1 distributor2)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck1) (available hoist7)
   goals met: 4 of 6
32. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 4 of 6
33. (unload hoist9 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist9)
   added: (lifting hoist9 crate1)
   goals met: 4 of 6
34. (drop hoist9 crate1 crate3 distributor1)
   deleted: (lifting hoist9 crate1) (clear crate3)
   added: (available hoist9) (at crate1 distributor1) (clear crate1) (on crate1 crate3)
   goals met: 5 of 6
35. (lift hoist5 crate0 crate2 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 crate2)
   added: (lifting hoist5 crate0) (clear crate2)
   goals met: 4 of 6
36. (lift hoist8 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist8) (on crate2 pallet5)
   added: (lifting hoist8 crate2) (clear pallet5)
   goals met: 4 of 6
37. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 4 of 6
38. (load hoist8 crate2 truck0 distributor2)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck0) (available hoist8)
   goals met: 4 of 6
39. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 4 of 6
40. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 4 of 6
41. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet3)
   goals met: 5 of 6
42. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 5 of 6
43. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   goals met: 5 of 6
44. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 5 of 6
45. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 5 of 6
46. (drop hoist3 crate0 crate2 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate2)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate2)
   goals met: 6 of 6
